Repository: mozilla-l10n/mt-training-data
Catalog: sat/sat_pontoon.tmx
Source language: en_us
Languages: sat

source: Yes, sign me in
sat: ᱦᱮᱸ, ᱵᱚᱞᱚ ᱪᱷᱚᱭᱤᱧ ᱢᱮ

source: Yesterday
sat: ᱦᱚᱞᱟ

source: You are signed in as %s on another Firefox browser on this device. Would you like to sign in with this account?
sat: ᱟᱢ %s ᱞᱮᱠᱷᱟᱛᱮ ᱚᱞᱜᱟ Firefox ᱵᱨᱟᱩᱡᱟᱹᱨ ᱨᱮ ᱟᱢᱟᱜ ᱥᱟᱫᱷᱚᱱ ᱛᱮ ᱵᱚᱞᱚ ᱟᱠᱟᱱᱟᱢ ᱾ ᱟᱢ ᱪᱮᱫ ᱱᱚᱶᱟ ᱠᱷᱟᱛᱟ ᱨᱮ ᱵᱚᱞᱚ ᱥᱟᱱᱟᱢ ᱠᱟᱱᱟ?

source: You are signed in as %s on another Firefox browser on this phone. Would you like to sign in with this account?
sat: ᱟᱢ %s ᱞᱮᱠᱷᱟᱛᱮ ᱚᱞᱜᱟ Firefox ᱵᱨᱟᱩᱡᱟᱹᱨ ᱨᱮ ᱟᱢᱟᱜ ᱥᱟᱫᱷᱚᱱ ᱛᱮ ᱵᱚᱞᱚ ᱟᱠᱟᱱᱟᱢ ᱾ ᱟᱢ ᱪᱮᱫ ᱱᱚᱶᱟ ᱠᱷᱟᱛᱟ ᱨᱮ ᱵᱚᱞᱚ ᱥᱟᱱᱟᱢ ᱠᱟᱱᱟ?

source: You can attempt to restore or close this tab below.
sat: ᱟᱢ ᱞᱟᱛᱟᱨ ᱨᱮ ᱢᱮᱱᱟᱜ ᱴᱮᱵ ᱫᱩᱦᱲᱟᱹ ᱫᱚᱦᱚ ᱟᱨ ᱵᱟᱝ ᱵᱚᱸᱫᱚᱭ ᱫᱟᱲᱮᱭᱟᱜᱼᱟᱢ ᱾

source: You can easily add this website to your device’s Home screen to have instant access and browse faster with an app-like experience.
sat: ᱟᱢ ᱞᱚᱜᱚᱱ ᱵᱨᱟᱩᱡ ᱟᱨ ᱮᱯᱯ ᱞᱮᱠᱷᱟᱱ ᱚᱱᱩᱵᱷᱟᱹᱵ ᱤᱫᱤ ᱞᱟᱹᱜᱤᱫ ᱣᱮᱵᱥᱟᱭᱤᱴ ᱫᱚ ᱥᱟᱫᱷᱚᱱ ᱨᱮᱭᱟᱜ ᱚᱲᱟᱜ ᱥᱠᱨᱭᱤᱱ ᱨᱮ ᱥᱮᱞᱮᱫᱽ ᱫᱟᱲᱮᱟᱜᱼᱟᱢ ᱾

source: You can easily add this website to your phone’s Home screen to have instant access and browse faster with an app-like experience.
sat: ᱟᱢ ᱞᱚᱜᱚᱱ ᱵᱨᱟᱩᱡ ᱟᱨ ᱮᱯᱯ ᱞᱮᱠᱷᱟᱱ ᱚᱱᱩᱵᱷᱟᱹᱵ ᱤᱫᱤ ᱞᱟᱹᱜᱤᱫ ᱣᱮᱵᱥᱟᱭᱤᱴ ᱫᱚ ᱥᱟᱫᱷᱚᱱ ᱨᱮᱭᱟᱜ ᱚᱲᱟᱜ ᱥᱠᱨᱭᱤᱱ ᱨᱮ ᱥᱮᱞᱮᱫᱽ ᱫᱟᱲᱮᱟᱜᱼᱟᱢ ᱾

source: You can set Firefox to automatically open links in apps.
sat: ᱟᱢ ᱮᱯᱯ ᱠᱚ ᱮᱢᱟᱱ ᱨᱮ ᱟᱡ ᱛᱮᱜᱮ ᱞᱤᱸᱠ ᱠᱚ ᱮᱢᱟᱱ ᱚᱰᱚᱠ ᱨᱮᱭᱟᱜ Firefox ᱨᱮ ᱥᱮᱴ ᱫᱟᱲᱮᱟᱜᱼᱟᱢ ᱾

source: You don’t have any tabs open in Firefox on your other devices.
sat: ᱟᱢ ᱴᱷᱮᱱ ᱚᱠᱟ ᱦᱚᱸ ᱴᱮᱵ ᱠᱚ ᱚᱞᱜᱟ Firefox ᱢᱮᱱᱟᱜ ᱥᱟᱫᱷᱚᱱ ᱨᱮ ᱵᱟᱝ ᱠᱷᱩᱞᱟᱹ ᱟᱠᱟᱱᱟ ᱾

source: You’ll be logged out of most sites
sat: ᱟᱢ ᱫᱚ ᱰᱷᱮᱨ ᱜᱟᱱ ᱥᱟᱭᱤᱴ ᱠᱷᱚᱱ ᱵᱟᱦᱨᱮ ᱩᱲᱩᱠ ᱢᱤᱭᱟ ᱠᱚ

source: You’re in a private session
sat: ᱟᱢ ᱱᱤᱡᱚᱨᱟᱜ ᱚᱠᱛᱚ ᱨᱮ ᱢᱮᱱᱟᱢ-ᱟ

source: Your open tabs will be shown here.
sat: ᱟᱢᱟᱜ ᱠᱷᱩᱞᱟᱹ ᱟᱠᱟᱱ ᱴᱮᱵ ᱠᱚ ᱫᱚ ᱱᱚᱰᱮ ᱫᱮᱠᱷᱟᱣᱜᱼᱟ ᱾

source: Your privacy
sat: ᱟᱢᱟᱜ ᱱᱤᱥᱚᱱ

source: Your private tabs will be shown here.
sat: ᱟᱢᱟᱜ ᱱᱤᱡᱚᱨᱟᱜ ᱴᱮᱵᱽ ᱠᱚ ᱫᱚ ᱱᱚᱰᱮ ᱩᱫᱩᱜ ᱦᱩᱭᱩᱜ-ᱟ ᱾

source: Your rights
sat: ᱟᱢᱟᱜ ᱦᱚᱠ ᱠᱚ

source: Your Rights
sat: ᱟᱢᱟᱜ ᱦᱚᱠ ᱠᱚ

source: Zoom on all websites
sat: ᱥᱟᱱᱟᱢ ᱣᱮᱵᱥᱟᱭᱤᱴ ᱨᱮ ᱦᱩᱰᱩᱧ ᱢᱮ

source: No
sat: ᱵᱟᱝ

source: Open in…
sat: ... ᱨᱮ ᱡᱷᱤᱡ ᱢᱮ

source: Password for %1$s
sat: %1$s ᱞᱟᱹᱜᱤᱫ ᱫᱟᱱᱟᱝ ᱥᱟᱵᱟᱫᱽ

source: Yes
sat: ᱦᱮᱸ

source: 1. Go to Settings
sat: 1. ᱥᱟᱡᱟᱣ ᱛᱮ ᱪᱟᱞᱟᱜ ᱢᱮ

source: 1 of %d files
sat: %d ᱨᱮᱫ ᱠᱷᱚᱱ 1

source: %1$@ on %2$@
sat: %1$@ ᱨᱮ %2$@

source: 2. Tap Default Browser App
sat: 2. ᱢᱩᱞ ᱵᱨᱟᱩᱡᱽᱟᱹᱨ ᱮᱯ ᱨᱮ ᱚᱛᱟᱭ ᱢᱮ

source: 3. Select Firefox
sat: 3. Firefox ᱵᱟᱪᱷᱟᱣᱢᱮ

source: Access your open tabs directly on your homescreen.
sat: ᱟᱢᱟᱜ ᱠᱷᱩᱞᱟᱹ ᱟᱠᱟᱱ ᱴᱮᱵ ᱠᱚ ᱥᱚᱡᱷᱮ ᱟᱹᱛᱩᱨ ᱢᱮ ᱟᱢᱟᱜ ᱚᱲᱟᱜ ᱤᱥᱠᱨᱤᱱ ᱨᱮ.

source: Account Verification Required
sat: ᱠᱷᱟᱛᱟ ᱯᱚᱨᱢᱟᱱ ᱫᱚᱨᱠᱟᱨ

source: Add a Firefox shortcut to your Home screen. After adding the widget, touch and hold to edit it and select a different shortcut.
sat: ᱢᱤᱫ ᱴᱟᱝ Firefox ᱠᱷᱟᱴᱚᱢᱟᱪᱷᱟ ᱚᱲᱟᱜ ᱤᱥᱠᱨᱤᱱ ᱨᱮ ᱥᱮᱞᱮᱫ ᱛᱟᱞᱟᱝ ᱢᱮ. ᱣᱤᱡᱮᱴ ᱥᱮᱞᱮᱫ ᱠᱟᱛᱮ ᱡᱚᱴᱮᱫ ᱢᱮ ᱟᱨ ᱚᱛᱟ ᱫᱚᱦᱚᱭ ᱢᱮ ᱥᱟᱯᱲᱟᱣ ᱞᱚᱜᱤᱛ ᱛᱮ ᱟᱨ ᱮᱴᱟᱜ-ᱟ ᱠᱷᱟᱴᱚᱢᱟᱪᱷᱟ ᱵᱟᱪᱷᱟᱣ ᱛᱟᱞᱟᱝ ᱢᱮ.

source: Added page to Reading List
sat: ᱥᱟᱠᱟᱢ ᱯᱟᱰᱦᱟᱣ ᱞᱤᱥᱴᱤ ᱨᱮ ᱡᱚᱰ.ᱟᱣᱮᱱᱟ

source: Added Search engine!
sat: ᱥᱮᱸᱫᱽᱨᱟ ᱤᱸᱡᱤᱱ ᱡᱩᱲᱣ ᱠᱤᱫᱟ!

source: Added to Reading List
sat: ᱯᱟᱰᱦᱟᱣ ᱞᱤᱥᱴᱤ ᱨᱮ ᱥᱮᱞᱮᱫᱮᱱᱟ

source: Added To Reading List
sat: ᱯᱟᱰᱦᱟᱣ ᱞᱤᱥᱴᱤ ᱨᱮ ᱥᱮᱞᱮᱫᱮᱱᱟ

source: Add Firefox shortcuts to your Home screen.
sat: Firefox ᱠᱷᱟᱴᱚᱢᱟᱪᱷᱟ ᱟᱢᱟᱜ ᱚᱲᱟᱜ ᱤᱥᱠᱨᱤᱱ ᱨᱮ ᱥᱮᱞᱮᱫ ᱢᱮ.

source: Address and Search
sat: ᱴᱷᱤᱠᱟᱹᱱᱟ ᱟᱨ ᱥᱮᱸᱫᱽᱨᱟ

source: Add Search Engine
sat: ᱥᱮᱸᱫᱽᱨᱟ ᱤᱸᱡᱤᱱ ᱥᱮᱞᱮᱫ ᱢᱮ

source: Add Search Provider?
sat: ᱥᱮᱸᱫᱽᱨᱟ ᱮᱢᱚᱜᱤᱡ ᱥᱮᱞᱮᱫᱮᱭᱟᱢ?

source: Add shortcuts to frequently and recently visited sites.
sat: ᱠᱷᱟᱴᱚᱢᱟᱪᱷᱟ ᱥᱮᱞᱮᱫ ᱢᱮ ᱵᱚᱨᱟᱵᱚᱨ ᱟᱨ ᱱᱤᱛᱚᱜ-ᱟ ᱥᱟᱭᱤᱴ ᱧᱮᱞᱟᱠ ᱨᱮ.

source: Add shortcuts to your open tabs.
sat: ᱟᱢᱟᱜ ᱠᱷᱩᱞᱟᱹ ᱟᱠᱟᱱ ᱴᱮᱵ ᱠᱚ ᱨᱮᱭᱟᱜ ᱥᱚᱴᱠᱚᱴ ᱠᱚ ᱥᱮᱞᱮᱫ ᱢᱮ ᱾

source: Add Tab
sat: ᱴᱮᱵ ᱥᱮᱞᱮᱫ ᱢᱮ

source: Add to Bookmarks
sat: ᱵᱩᱠᱢᱟᱨᱠ ᱨᱮ ᱡᱚᱲᱹᱟᱣ

source: Add to Reading List
sat: ᱯᱟᱰᱦᱟᱣ ᱞᱤᱥᱴᱤ ᱨᱮ ᱥᱮᱞᱮᱫ ᱢᱮ

source: A device has disconnected from Firefox Sync
sat: ᱢᱤᱫᱴᱟᱹᱝ ᱥᱟᱫᱷᱚᱱ ᱵᱟᱰ ᱡᱚᱲᱟᱣᱮᱱᱟ Firefox ᱛᱚᱞ ᱡᱚᱠᱷᱟ ᱠᱷᱚᱱ

source: After 10 minutes
sat: ᱑᱐ ᱴᱤᱯᱤᱡ ᱛᱟᱭᱚᱢ

source: After 15 minutes
sat: ᱑᱕ ᱴᱤᱯᱤᱡ ᱛᱟᱭᱚᱢ

source: After 1 hour
sat: ᱢᱤᱫ ᱴᱟᱲᱟᱝ ᱛᱟᱭᱚᱢ

source: After 1 minute
sat: ᱑ ᱴᱤᱯᱤᱡ ᱛᱟᱭᱚᱢ

source: After 5 minutes
sat: ᱕ ᱴᱤᱯᱤᱡ ᱛᱟᱭᱚᱢ

source: Align QR code within frame to scan
sat: Scan ᱞᱟᱹᱜᱤᱛ ᱛᱮ QR ᱠᱳᱰ ᱥᱟᱡ ᱵᱷᱤᱛᱨᱤ ᱨᱮ ᱛᱷᱟᱨ ᱦᱚᱪᱚᱜ ᱢᱮ

source: All
sat: ᱡᱷᱚᱛᱚ

source: Allows some ad tracking so websites function properly.
sat: ᱰᱷᱟᱣᱨᱟᱹ ᱞᱟᱹᱜᱤᱫ ᱠᱤᱪᱷᱤ ᱜᱷᱮᱨ ᱮᱥᱮᱫ ᱢᱟᱸᱡᱩᱨ ᱮᱢᱟᱭ ᱠᱤᱪᱷᱤ ᱣᱮᱵᱥᱟᱭᱤᱴ ᱠᱟᱫᱢᱤ ᱟᱭ

source: Allows some trackers so websites function properly.
sat: ᱯᱟᱧᱡᱟ ᱫᱟᱱᱟᱲ ᱠᱚ ᱦᱮᱸᱥᱤᱭᱟᱨ ᱠᱚᱢ ᱚᱝᱠᱟ ᱞᱮᱠᱷᱟᱱ ᱣᱮᱵᱥᱟᱭᱤᱴ ᱵᱮᱥ ᱠᱟᱹᱢᱤᱟᱭ ᱾

source: Always Send
sat: ᱡᱟᱣᱜᱮ ᱵᱷᱮᱡᱟ

source: Amazon
sat: ᱟᱹᱢᱮᱡᱳᱱ

source: An error occured while adding the pass to Wallet. Please try again later.
sat: ᱥᱟᱭᱤᱴ ᱨᱮ ᱣᱟᱞᱮᱴ ᱛᱮ ᱯᱟᱥ ᱡᱷᱚᱜ ᱵᱷᱩᱞ ᱦᱩᱭᱮᱱᱟ ᱾ ᱫᱚᱭᱟᱠᱟᱛᱮ ᱯᱚᱨᱮ ᱫᱩᱦᱲᱟᱹ ᱪᱮᱥᱴᱟᱭ ᱢᱮ ᱾

source: Are you sure you want to cancel this download?
sat: ᱟᱢ ᱜᱚᱴᱟ ᱢᱮᱱᱟᱢ-ᱟ ᱱᱚᱶᱟ ᱚᱛᱩᱨ ᱟᱲᱜᱩ ᱵᱟ.ᱰᱨᱟ. ᱞᱟ.ᱜᱤ ᱛᱮ?

source: Are you sure you want to delete it and its contents?
sat: ᱟᱢ ᱥᱟᱹᱨᱤ ᱛᱮ ᱱᱚᱶᱟ ᱟᱨ ᱚᱱᱟ ᱨᱮᱭᱟᱜ ᱡᱤᱱᱤᱥ ᱠᱚ ᱜᱮᱫ ᱜᱤᱰᱤ ᱥᱟᱱᱟᱢ ᱠᱟᱱᱟ?

source: A search engine with this title or URL has already been added.
sat: ᱯᱟᱱᱛᱮ ᱮᱱᱡᱤᱱ ᱱᱚᱶᱟ ᱴᱭᱴᱤᱞ ᱟᱨ ᱵᱟᱝ URL ᱥᱟᱞᱟᱜ ᱢᱟᱲᱟᱝ ᱠᱷᱚᱱ ᱜᱮ ᱥᱮᱞᱮᱫ ᱟᱠᱟᱱᱟ ᱾

source: A username and password are being requested by %@.
sat: ᱢᱤᱫᱴᱟᱹᱝ ᱵᱮᱵᱷᱟᱨᱤᱭᱟ ᱟᱨ ᱫᱟᱱᱟᱝ ᱥᱟᱵᱟᱫ %@ ᱮ ᱱᱮᱦᱚᱨ ᱟᱠᱟᱫᱟᱭ ᱾

source: A username and password are being requested by %1$@. The site says: %2$@
sat: ᱢᱤᱫᱴᱟᱹᱝ ᱵᱮᱵᱷᱟᱨᱤᱭᱟ ᱟᱨ ᱫᱟᱫᱟᱝ ᱥᱟᱵᱟᱫ %1$@ ᱮ ᱱᱮᱦᱚᱨ ᱟᱠᱟᱫᱟᱭ ᱾ ᱥᱟᱭᱤᱴ ᱮ ᱢᱮᱱᱮᱫᱟᱭᱺ%2$@

source: Authentication required
sat: ᱯᱚᱨᱢᱟᱱ ᱞᱟᱹᱠᱛᱤ

source: Automatically
sat: ᱟᱪᱛᱮ

source: Automatic Privacy
sat: ᱟᱪ ᱛᱮᱭᱟᱠ ᱱᱤᱡᱮᱨᱟᱠ

source: Available Credentials:
sat: ᱢᱮᱱᱟᱜᱠᱟᱱ ᱧᱩᱛᱩᱢ ᱦᱟᱹᱨ:

source: Available devices:
sat: ᱧᱟᱢᱚᱜᱟ ᱥᱟᱫᱷᱚᱱ:

source: Balanced for protection and performance.
sat: ᱥᱩᱨᱟᱠᱷᱤᱭᱟᱹ ᱨᱮ ᱮᱵᱥ ᱠᱟᱹᱢᱤ ᱞᱟᱹᱜᱤᱫ ᱥᱟᱹᱛᱩᱞᱟᱹᱱ

source: Blank Page
sat: ᱮᱠᱷᱮᱱᱟ ᱥᱟᱦᱴᱟ

source: Blocked Cross-Site Tracking Cookies
sat: ᱠᱨᱚᱥ ᱼᱥᱟᱭᱤᱴ ᱜᱷᱮᱨ ᱮᱥᱮᱫ ᱠᱩᱠᱤ ᱠᱚ ᱟᱴᱠᱟᱣ ᱮᱱᱟ

source: Blocked Cryptominers
sat: ᱟᱴᱠᱟᱣ ᱠᱨᱤᱯᱴᱳᱢᱟᱤᱱᱮᱨ ᱠᱚ

source: Blocked Fingerprinters
sat: ᱠᱟᱹᱴᱩᱵᱪᱷᱟᱯᱟ ᱟᱜ ᱟᱴᱠᱟᱣᱮᱱᱟ

source: Blocked Social Trackers
sat: ᱥᱟᱸᱣᱛᱟ ᱯᱟᱸᱡᱟ ᱠᱚ ᱟᱴᱠᱟᱣᱮᱱᱟ

source: Block Images
sat: ᱪᱤᱛᱟᱹᱨ ᱠᱚ ᱟᱴᱠᱟᱣ ᱢᱮ

source: Blocking trackers could impact the functionality of some websites.
sat: ᱯᱟᱧᱡᱟ ᱫᱟᱱᱟᱲ ᱠᱚ ᱟᱴᱠᱟᱣ ᱞᱮᱠᱷᱟᱱ ᱣᱮᱵᱥᱟᱭᱤᱴ ᱨᱮᱭᱟᱜ ᱠᱟᱹᱤ ᱠᱮ ᱨᱮ ᱯᱨᱚᱵᱷᱟᱣ ᱯᱟᱲᱟᱣᱜ ᱟ ᱾

source: Block online trackers
sat: ᱚᱱᱞᱟᱤᱱ ᱯᱟᱸᱡᱟ ᱠᱚ ᱟᱴᱠᱟᱣ ᱢᱮ

source: Block Pop-up Windows
sat: ᱴᱟᱴᱠᱟ ᱚᱰᱚᱠ ᱧᱮᱧᱮᱞᱚᱢ ᱠᱚ ᱟᱴᱠᱟᱣ

source: BLOCKS
sat: ᱟᱴᱠᱟᱹᱣ

source: Blocks known trackers. Some websites may not function properly.
sat: ᱵᱥᱟᱭᱟᱠᱟᱱ ᱯᱟᱧᱡᱟ ᱫᱟᱱᱟᱲ ᱠᱚ ᱟᱴᱠᱟᱣ ᱠᱚᱟᱭ ᱾ ᱠᱤᱪᱷᱤ ᱣᱮᱵᱥᱟᱭᱤᱴ ᱴᱷᱤᱠ ᱥᱮ ᱵᱟᱭ ᱠᱟᱹᱢᱤ ᱫᱟᱲᱮᱟᱭᱜᱼᱟᱭ ᱾

source: Blocks more trackers, ads, and popups. Pages load faster, but some functionality may not work.
sat: ᱡᱟᱹᱥᱛᱤ ᱯᱟᱧᱡᱟ ᱫᱟᱱᱟᱲ, ᱰᱷᱟᱣᱨᱟ ᱟᱨ ᱴᱟᱴᱠᱟ ᱚᱰᱚᱠ ᱠᱚ ᱟᱴᱠᱟᱣ ᱟᱭ , ᱥᱟᱠᱟᱢ ᱞᱚᱜᱚᱱ ᱞᱚᱰᱚᱜᱼᱟ ᱦᱮᱞᱮ ᱠᱤᱪᱷᱤ ᱡᱤᱱᱤᱥ ᱴᱷᱤᱠ ᱥᱮ ᱵᱟᱭ ᱠᱟᱹᱢᱤᱟᱭ ᱾

source: Bookmark Added
sat: ᱵᱩᱩᱠᱢᱟᱨᱠ ᱡᱚᱰ.ᱟᱣᱮᱱᱟ

source: Bookmarked
sat: ᱵᱩᱩᱠᱢᱟᱨᱠ ᱦᱩᱭᱮᱱᱟ

source: Bookmark Link
sat: ᱵᱩᱠᱢᱟᱨᱠ ᱞᱤᱸᱠ

source: Bookmark Removed
sat: ᱵᱩᱩᱠᱢᱟᱨᱠ ᱚᱪᱚᱜᱟᱠᱟᱱᱟ

source: Bookmarks you save will show up here.
sat: ᱟᱢ ᱡᱟ ᱵᱩᱠᱢᱟᱨᱠ ᱥᱟᱸᱪᱟᱣᱟᱢ ᱚᱱᱟ ᱫᱚ ᱱᱚᱸᱲᱮ ᱩᱫᱩᱜᱚᱣᱟ᱾

source: Bookmark This Page
sat: ᱱᱚᱶᱟ ᱥᱟᱦᱴᱟ ᱵᱩᱩᱠᱢᱟᱨᱠ ᱢᱮ

source: Brightness
sat: ᱪᱚᱠᱢᱚᱠ

source: Bring bookmarks, history, and passwords to Firefox on this device.
sat: ᱱᱚᱶᱟ ᱥᱟᱫᱷᱚᱱ ᱨᱮ Firefox ᱛᱮ ᱵᱩᱠᱢᱟᱨᱠ , ᱦᱤᱛᱟᱹᱞ, ᱟᱨ ᱫᱟᱱᱟᱝ ᱥᱟᱵᱟᱫ ᱟᱹᱜᱩᱭ ᱢᱮ ᱾

source: Browse like no one’s watching
sat: ᱵᱨᱟᱩᱡ ᱢᱮ ᱡᱮᱞᱠᱟ ᱚᱠᱚᱭ ᱦᱚᱸ ᱵᱟᱠᱚ ᱧᱮᱞᱮᱫ ᱢᱮᱭᱟ

source: Browsing History
sat: ᱱᱟᱜᱟᱢ ᱯᱟᱱᱛᱮ

source: Built-in Enhanced Tracking Protection helps stop ads from following you around. Turn on Strict to block even more trackers, ads, and popups.
sat: ᱵᱷᱤᱛᱨᱤ ᱨᱮ ᱛᱮᱭᱟᱨ ᱵᱟᱲᱦᱟᱣᱟᱠᱟᱱ ᱯᱟᱧᱡᱟ ᱫᱟᱱᱟᱲ ᱪᱤᱱᱦᱟᱹ ᱟᱰ ᱫᱚ ᱤᱥᱛᱤᱭᱟᱨ ᱟᱢ ᱯᱟᱧᱡᱟ ᱠᱚ ᱵᱚᱸᱫ ᱪᱷᱚᱭ ᱟ ᱾ ᱯᱟᱧᱡᱟ ᱫᱟᱱᱟᱲ, ᱤᱥᱛᱤᱭᱟᱨ ᱟᱨ ᱴᱟᱴᱠᱟ ᱳᱰᱚᱠ ᱫᱚ ᱠᱷᱟᱸᱴᱤ ᱚᱱ ᱠᱟᱛᱮ ᱵᱚᱸᱫᱚ ᱪᱷᱚᱭ ᱢᱮ ᱾

source: Cache
sat: ᱥᱟᱯ

source: Cancel Download
sat: ᱚᱛᱩᱨ ᱟᱲᱜᱩ ᱵᱟᱹᱰᱨᱟᱹᱭ ᱢᱮ

source: Cannot Open Page
sat: ᱥᱟᱦᱴᱟ ᱵᱟᱞᱮ ᱠᱷᱩᱞᱟᱹᱣ ᱫᱟᱹᱲᱤ ᱭᱟᱫᱟ

source: Change Passcode
sat: ᱯᱟᱥᱠᱳᱰ ᱵᱚᱫᱚᱞ

source: Changes color theme.
sat: ᱩᱭᱦᱚᱨ ᱨᱚᱲ ᱵᱚᱫᱚᱞ ᱟᱭ

source: Changes font type.
sat: ᱪᱤᱠᱤ ᱵᱚᱫᱚᱞ ᱨᱚᱠᱚᱢ ᱾

source: Choose what to load when opening a new tab
sat: ᱵᱟᱪᱷᱟᱣ ᱢᱮ ᱪᱦᱤ ᱞᱟᱫᱮᱭᱟ ᱡᱚᱠᱷᱚᱱ ᱱᱟᱶᱟ ᱴᱮᱵ ᱠᱷᱩᱞᱟᱹ-ᱟ

source: Clear All Website Data
sat: ᱡᱚᱛᱚ ᱣᱮᱵ ᱥᱟᱭᱤᱴ ᱥᱟᱠᱷᱤᱭᱟᱛ ᱯᱷᱟᱨᱪᱟᱭ ᱢᱮ

source: Clearing Recent History will remove history, cookies, and other browser data.
sat: ᱱᱤᱛᱚᱠᱟ ᱦᱤᱛᱟᱞ ᱯᱷᱟᱨᱪᱟ ᱞᱮᱠᱷᱟᱭ ᱦᱤᱛᱟᱞ, ᱠᱩᱠᱤ ᱠᱚ ᱟᱨ ᱮᱴᱟᱜᱟ ᱯᱟᱱᱛᱮᱭᱟᱠ ᱨᱮᱭᱟ ᱥᱟᱠᱷᱤᱭᱟᱛ ᱚᱪᱚᱜᱳᱣᱟ᱾

source: Clear Private Data
sat: ᱱᱤᱡᱮᱨᱟᱠ ᱥᱟᱠᱷᱤᱭᱟᱛ ᱚᱪᱚᱜ ᱢᱮ

source: Clear Private Tabs
sat: ᱱᱤᱡᱮᱨᱟᱠ ᱴᱮᱵᱠᱚ ᱢᱮᱴᱟᱣ ᱢᱮ

source: Clear Recent History…
sat: ᱱᱤᱛᱚᱠᱟ ᱱᱟᱜᱟᱢ ᱯᱷᱟᱨᱪᱟᱭ ᱢᱮ...

source: Clear Search
sat: ᱯᱟᱱᱛᱮ ᱯᱷᱟᱨᱪᱟ

source: Close All Tabs
sat: ᱡᱚᱛᱚ ᱴᱮᱵ ᱵᱚᱸᱫᱚᱭ

source: Close Private Tabs
sat: ᱱᱤᱡᱮᱨᱟᱠ ᱴᱮᱵ ᱠᱚ ᱵᱚᱸᱫᱚ

source: Close Selected Tab
sat: ᱵᱟᱪᱷᱟᱣᱟᱠ ᱴᱮᱵ ᱵᱚᱸᱫᱚᱭ ᱢᱮ

source: Close Tab
sat: ᱴᱮᱵ ᱵᱚᱸᱫᱚᱭ ᱢᱮ

source: Closing tab
sat: ᱴᱮᱵ ᱵᱚᱸᱫᱚ ᱦᱩᱭᱩ ᱠᱟᱱᱟ

source: computer
sat: ᱠᱚᱢᱯᱤᱭᱩᱴᱚᱨ

source: Connect Another Device
sat: ᱚᱞᱜᱟ ᱥᱟᱫᱷᱚᱱ ᱡᱩᱰᱟᱹᱣ ᱢᱮ

source: Copied Link from clipboard
sat: ᱨᱮᱴᱚᱯᱵᱚᱰ ᱠᱷᱚᱱ ᱞᱤᱸᱠ ᱱᱚᱠᱚᱞ ᱮᱱᱟ

source: Copied to clipboard
sat: ᱨᱮᱴᱚᱯ ᱵᱳᱨᱰ ᱨᱮ ᱱᱚᱠᱚᱞᱮᱱᱟ

source: Copy Address
sat: ᱴᱷᱤᱠᱚᱱᱟ ᱱᱚᱠᱚᱞ ᱢᱮ

source: Copy Image
sat: ᱪᱤᱛᱟᱹᱨ ᱱᱚᱠᱚᱞ ᱢᱮ

source: Copy Image Link
sat: ᱪᱤᱛᱟᱹᱨ ᱨᱮᱭᱟᱜ ᱞᱤᱸᱠ ᱱᱚᱠᱚᱞ ᱢᱮ

source: Copy Link
sat: ᱞᱤᱸᱠ ᱱᱚᱠᱚᱞ ᱢᱮ

source: Copy URL
sat: URL ᱱᱚᱠᱚᱞ‌ ᱢᱮ

source: Could not add page to Reading list
sat: ᱯᱟᱰᱦᱟᱣ ᱞᱤᱥᱴᱤ ᱨᱮ ᱥᱟᱦᱴᱟ ᱵᱟᱞᱮ ᱥᱮᱞᱮᱫ ᱫᱟᱲᱤᱭᱟᱫᱟ

source: Could not add page to Reading List. Maybe it’s already there?
sat: ᱥᱟᱦᱴᱟ ᱫᱚ ᱯᱟᱲᱦᱟᱣ ᱛᱟᱞᱠᱟ ᱨᱮ ᱵᱟᱭ ᱥᱮᱞᱮᱫᱚᱜ ᱠᱟᱱᱟ ᱾ ᱦᱩᱭᱫᱟᱲᱮᱭᱟᱼᱜᱟ ᱢᱟᱲᱟᱝ ᱠᱷᱟᱱ ᱛᱟᱦᱮᱸ ᱠᱚᱜᱼᱟ?

source: Could not load page.
sat: ᱥᱟᱦᱴᱟ ᱵᱟᱞᱮ ᱞᱟᱫᱮ ᱫᱟᱲᱤᱭᱟᱫᱟ᱾

source: Create an account
sat: ᱢᱤᱫᱴᱟᱹᱝ ᱠᱷᱟᱛᱟ ᱛᱮᱭᱟᱨ ᱢᱮ

source: Created %@
sat: %@ ᱨᱮ ᱛᱮᱭᱟᱨᱮᱱᱟ

source: Cross-Site Trackers
sat: ᱠᱨᱚᱥᱼᱥᱟᱭᱤᱴ ᱯᱟᱧᱡᱟ ᱫᱟᱱᱟᱲ ᱠᱩ

source: Cryptominers secretly use your system’s computing power to mine digital money. Cryptomining scripts drain your battery, slow down your computer, and can increase your energy bill.
sat: ᱠᱨᱭᱯᱴᱚᱢᱟᱭᱱ ᱠᱚ ᱦᱩᱠᱩ ᱛᱮ ᱟᱢᱟᱜ ᱥᱭᱥᱴᱚᱢ ᱨᱮᱭᱟᱜ ᱯᱟᱣᱟᱨ ᱵᱮᱵᱦᱟᱨ ᱠᱟᱛᱮ ᱰᱤᱴᱟᱞ ᱯᱩᱭᱥᱟᱹ ᱠᱚ ᱦᱟᱛᱟᱣᱮᱫᱟ ᱾ ᱠᱨᱭᱯᱴᱚᱢᱟᱭᱱᱤᱝ ᱥᱠᱨᱤᱯᱴ ᱟᱢᱟᱜ ᱵᱮᱴᱨᱭ ᱞᱚᱜᱚᱱ ᱪᱟᱵᱟᱭᱟ ᱾ ᱠᱚᱢᱯᱩᱴᱚᱨ ᱠᱚ ᱵᱟᱹᱭ ᱵᱟᱹᱭ ᱪᱷᱚᱭ ᱟ, ᱟᱨ ᱟᱢᱟᱜ ᱫᱟᱲᱮ ᱵᱤᱞ ᱠᱚ ᱨᱟᱠᱟᱵ ᱪᱷᱚ ᱫᱟᱲᱮᱜᱼᱟᱭ ᱾

source: Current Homepage
sat: ᱱᱤᱛᱚᱜᱟ ᱚᱲᱟᱜ ᱥᱟᱦᱴᱟ

source: Customize Firefox Home
sat: Firefox ᱚᱲᱟᱜ ᱠᱩᱥᱤᱭᱟᱠ ᱛᱮᱭᱟᱨ ᱢᱮ

source: Customize Top Sites
sat: ᱪᱮᱛᱟᱱ ᱥᱟᱭᱤᱴ ᱠᱚᱥᱴᱚᱢᱟᱭᱤᱡ

source: Custom URL
sat: ᱠᱩᱥᱤᱭᱟᱠ URL

source: Dark theme now includes a dark keyboard and dark splash screen.
sat: ᱦᱮᱸᱫᱮ ᱩᱭᱦᱚᱨ ᱨᱮ ᱱᱤᱛᱠ ᱫᱚ ᱦᱮᱸᱫᱮ ᱠᱟᱴᱷᱤ ᱵᱳᱨᱲ ᱟᱨ ᱦᱮᱸᱫᱮ ᱪᱷᱤᱴᱠᱟᱣ ᱯᱚᱨᱫᱟ ᱥᱟᱹᱢᱤᱞᱮᱱᱟ᱾

source: Data Management
sat: ᱥᱟᱠᱷᱤᱭᱟᱛ ᱵᱮᱵᱚᱥᱛᱟ

source: %d device(s) connected
sat: %d ᱥᱟᱫᱷᱚᱱ ᱠᱚ ᱡᱚᱲᱟᱣ ᱢᱮᱱᱟ-ᱟ

source: Decrease text size
sat: ᱚᱱᱚᱞ ᱢᱟᱨᱟᱲᱛᱮᱛ ᱠᱚᱢ ᱢᱮ

source: Default Browser App
sat: ᱢᱩᱞ ᱵᱨᱟᱩᱡᱽᱟᱹᱨ ᱮᱯ

source: Default Search Engine
sat: ᱢᱩᱞ ᱥᱮᱸᱫᱽᱨᱟ ᱤᱸᱡᱤᱱ

source: Delete from History
sat: ᱦᱤᱛᱟᱹᱞ ᱠᱷᱚᱱ ᱢᱮᱴᱟᱣ ᱢᱮ

source: Deselect All
sat: ᱡᱚᱛᱚ ᱵᱟᱪᱷᱟᱣ ᱠᱷᱚᱱ ᱚᱪᱚᱜ

source: Device Name
sat: ᱥᱟᱫᱷᱚᱱ ᱨᱮᱭᱟᱜ ᱧᱩᱛᱩᱢ

source: Disabled for this site
sat: ᱱᱚᱶᱟ ᱥᱟᱭᱤᱴ ᱞᱟᱹᱜᱤᱛ ᱵᱟᱝ ᱦᱩᱭ ᱦᱚᱪᱚᱜ ᱢᱮᱱᱟ-ᱟ

source: Disconnect Sync
sat: ᱛᱚᱞ ᱡᱚᱠᱷᱟ ᱵᱟᱝ ᱡᱚᱲᱟᱣ

source: Disconnect Sync?
sat: ᱛᱚᱞ ᱡᱚᱠᱷᱟ ᱵᱟᱝ ᱡᱚᱲᱟᱣ?

source: Discover fascinating and thought-provoking stories from across the web, curated by Pocket.
sat: ᱣᱮᱵ ᱠᱷᱚᱱ ᱚᱲᱤ ᱵᱟᱛᱟᱨ ᱟᱨ ᱪᱤᱱᱛᱮ ᱵᱷᱟᱵᱱᱟ ᱮᱦᱚᱵ ᱠᱚᱦᱱᱤ ᱠᱚ ᱭᱟᱢ ᱢᱮ ᱡᱟ ᱯᱚᱠᱮᱴ ᱠᱤᱭᱩᱨᱮᱴ ᱠᱟᱫᱟᱭ.

source: Display Settings
sat: ᱩᱫᱩᱠ ᱥᱟᱡᱟᱣ ᱠᱚ

source: +%d More…
sat: +%d ᱵᱚᱲᱛᱤ...

source: Done
sat: ᱦᱩᱭᱮᱱᱟ

source: Don’t Save
sat: ᱟᱞᱚᱢ ᱥᱟᱸᱪᱟᱣ-ᱟ

source: Don’t Send
sat: ᱵᱟᱲ ᱵᱷᱮᱡᱟ

source: Don’t Update
sat: ᱟᱞᱚᱢ ᱦᱟᱞᱤᱭᱟᱠ-ᱟ

source: Download Cancelled
sat: ᱚᱛᱩᱨ ᱟᱲᱜᱩ ᱵᱟᱹᱰᱨᱟᱹᱭᱮᱱᱟ

source: Downloaded Files
sat: ᱨᱮᱫ ᱟᱹᱛᱩᱨ ᱟᱬᱜᱚ

source: Downloaded files will show up here.
sat: ᱟᱹᱛᱩᱨ ᱟᱬᱜᱚ ᱨᱮᱫ ᱠᱚ ᱱᱚᱰᱮ ᱫᱮᱠᱷᱟᱣᱟᱭ ᱾

source: Download Failed
sat: ᱟᱹᱛᱩᱨ ᱟᱲᱜᱚ ᱲᱤᱜᱟᱣᱮᱱᱟ

source: Download Link
sat: ᱚᱛᱩᱨ ᱟᱲᱜᱚ ᱞᱤᱸᱠ

source: Download Now
sat: ᱱᱤᱛᱚᱜ ᱚᱛᱩᱨ ᱟᱲᱜᱩᱤ ᱢᱮ

source: Downloads aren’t supported in Firefox yet.
sat: Firefox ᱨᱮ ᱱᱤᱛ ᱦᱟᱹᱵᱤᱡ ᱛᱮ ᱟᱹᱛᱩᱨ ᱟᱬᱜᱚ ᱵᱟᱭ ᱥᱟᱯᱚᱴ ᱟ ᱾

source: Do you want to use this web page as your home page?
sat: ᱟᱢ ᱱᱚᱶᱟ ᱣᱮᱵ ᱥᱟᱦᱴᱟ ᱚᱲᱟᱜ ᱥᱟᱦᱴᱟ ᱞᱮᱠᱟ ᱵᱮᱵᱷᱟᱨ ᱪᱚᱭᱳ ᱠᱟᱱᱟᱢ?

source: %d tab(s) closed
sat: %d ᱴᱮᱵ ᱠᱚ ᱵᱚᱸᱫᱚ ᱟᱠᱟᱫᱟ

source: Edit Bookmark
sat: ᱵᱩᱠᱢᱟᱨᱠ ᱥᱟᱯᱲᱟᱣ

source: Edit Folder
sat: ᱯᱚᱴᱚᱢ ᱥᱟᱯᱲᱟᱣ ᱢᱮ

source: Enabled for this site
sat: ᱱᱚᱶᱟ ᱥᱟᱭᱤᱴ ᱞᱟᱹᱜᱤᱛ ᱦᱩᱭ ᱦᱚᱪᱚᱜ ᱢᱮᱱᱟ-ᱟ

source: Enable for this site
sat: ᱱᱚᱶᱟ ᱥᱟᱤᱴ ᱞᱟᱹᱜᱤᱛ ᱦᱩᱭ ᱦᱚᱪᱚᱜ ᱢᱮ

source: Enable Night Mode
sat: ᱱᱤᱸᱫᱚ ᱚᱵᱥᱛᱟ ᱦᱩᱭ ᱦᱚᱪᱚᱜ ᱢᱮ

source: Enable Tracking Protection
sat: ᱯᱟᱸᱡᱟ ᱨᱚᱯᱷᱟ ᱦᱩᱭ ᱦᱚᱪᱚᱜ ᱢᱮ

source: Enhanced Tracking Protection blocks malware and stops trackers.
sat: ᱵᱟᱲᱦᱟᱣᱟᱠᱟᱱ ᱯᱟᱧᱡᱟ ᱫᱟᱱᱟᱲ ᱪᱤᱱᱦᱟᱹ ᱟᱰ ᱢᱟᱞᱣᱮᱨ ᱟᱨ ᱯᱟᱧᱡᱟ ᱫᱟᱱᱟᱲ ᱠᱚᱭ ᱟᱴᱠᱟᱣ ᱠᱚᱟᱭ ᱾

source: Enhanced Tracking Protection is OFF for this site.
sat: ᱱᱚᱶᱟ ᱥᱟᱭᱤᱴ ᱞᱟᱹᱜᱤᱛ ᱵᱟᱲᱦᱟᱣᱟᱠᱟᱱ ᱯᱟᱸᱡᱟ ᱨᱚᱯᱷᱟ ᱵᱚᱸᱫᱚ ᱢᱮᱱᱟ-ᱟ

source: Enhanced Tracking Protection is ON for this site.
sat: ᱱᱚᱶᱟ ᱥᱟᱤᱴ ᱞᱟᱹᱜᱤᱛ ᱵᱟᱲᱦᱟᱣᱟᱠᱟᱱ ᱯᱟᱸᱡᱟ ᱨᱚᱯᱷᱟ ᱚᱱ ᱢᱮᱱᱟ-ᱟ ᱾

source: Enter a new passcode
sat: ᱱᱟᱶᱟ ᱯᱟᱥᱠᱳᱰ ᱟᱫᱮᱨ ᱢᱮ

source: Enter a passcode
sat: ᱢᱤᱫᱴᱟᱹᱝ ᱯᱟᱥᱠᱳᱰ ᱟᱫᱮᱨ ᱢᱮ

source: Enter a webpage
sat: ᱢᱤᱫᱴᱟᱹᱝ ᱣᱮᱵ ᱥᱟᱦᱴᱟ ᱟᱫᱮᱨ ᱢᱮ

source: Enter passcode
sat: ᱯᱟᱥᱠᱳᱰ ᱟᱫᱮᱨ

source: Enter Passcode
sat: ᱯᱟᱥᱠᱳᱰ ᱟᱫᱮᱨ

source: Enter Search Mode
sat: ᱯᱟᱱᱛᱮ ᱚᱵᱚᱥᱛᱟ ᱵᱚᱞᱚ ᱢᱮ

source: Enter your password to connect
sat: ᱡᱚᱲᱟᱣ ᱞᱟᱹᱜᱤ ᱛᱮ ᱟᱢᱟᱜ ᱫᱟᱱᱟᱲ ᱥᱟᱵᱟᱫ ᱟᱫᱮᱨ ᱢᱮ

source: Everything
sat: ᱡᱚᱛᱚᱣᱟᱠ

source: Face ID & Passcode
sat: ᱨᱩᱯ ID ᱟᱨ ᱯᱟᱥᱠᱳᱰ

source: Failed
sat: ᱰᱤᱜᱟᱹᱣᱮᱱᱟ

source: Failed to Add Pass
sat: ᱥᱟᱠᱟᱢ ᱥᱮᱞᱮᱫ ᱡᱷᱚᱜ ᱰᱤᱜᱟᱹᱣᱮᱱᱟ

source: Fast, private, and on your side.
sat: ᱞᱚᱜᱚᱱ, ᱱᱤᱡᱚᱨᱟᱜ ᱟᱨ ᱟᱢᱟᱜ ᱥᱟᱢᱟᱝ ᱨᱮ ᱾

source: Fast Search
sat: ᱞᱚᱜᱚᱱ ᱥᱮᱸᱫᱽᱨᱟ

source: Filter
sat: ᱪᱷᱟᱹᱱᱤ

source: Filter Sites
sat: ᱥᱟᱤᱴ ᱠᱚ ᱪᱷᱚᱱᱤ ᱢᱮ

source: Find
sat: ᱥᱮᱸᱫᱽᱨᱟᱭ ᱢᱮ

source: Find in Page
sat: ᱥᱟᱠᱟᱢ ᱨᱮ ᱯᱟᱱᱛᱮ ᱢᱮ

source: Firefox blocks cross-site trackers, social trackers, cryptominers, and fingerprinters.
sat: ᱠᱨᱚᱥ ᱼᱥᱟᱭᱤᱴ ᱯᱟᱧᱡᱟ ᱫᱟᱱᱟᱲ ᱠᱚ, ᱥᱟᱸᱣᱛᱟ ᱯᱟᱧᱡᱟ ᱫᱟᱱᱟᱲ ᱠᱚ,ᱠᱨᱭᱯᱴᱚᱢᱟᱭᱱᱟᱹᱨ ᱠᱚ, ᱟᱨ ᱠᱟᱹᱴᱩᱵᱪᱷᱟᱯᱟ ᱠᱚ Firefox ᱮᱥᱮᱫ ᱛᱮᱦᱮᱱ ᱟᱭ.

source: Firefox blocks cross-site trackers, social trackers, cryptominers, fingerprinters, and tracking content.
sat: ᱠᱨᱚᱥ ᱼᱥᱟᱭᱤᱴ ᱯᱟᱧᱡᱟ ᱫᱟᱱᱟᱲ ᱠᱚ, ᱥᱟᱸᱣᱛᱟ ᱯᱟᱧᱡᱟ ᱫᱟᱱᱟᱲ ᱠᱚ,ᱠᱨᱭᱯᱴᱚᱢᱟᱭᱱᱟᱹᱨ ᱠᱚ, ᱠᱟᱹᱴᱩᱵᱪᱷᱟᱯᱟ ᱠᱚ ᱟᱨ ᱯᱟᱧᱡᱟ ᱫᱟᱱᱟᱲ ᱡᱤᱱᱤᱥ ᱠᱚ Firefox ᱮᱥᱮᱫ ᱛᱮᱦᱮᱱ ᱟᱭ.

source: Firefox cannot open the page because it has an invalid address.
sat: ᱵᱟᱝ ᱴᱷᱤᱠ ᱴᱷᱤᱠᱬᱟᱹ ᱞᱟᱹᱜᱤᱫ Firefox ᱱᱚᱶᱟ ᱥᱟᱦᱴᱟ ᱵᱟᱝ ᱚᱰᱚᱠ ᱫᱟᱲᱮᱟᱜ ᱠᱟᱱᱟ ᱾

source: Firefox Credentials
sat: Firefox ᱧᱩᱛᱩᱢ ᱦᱟᱨ

source: Firefox Home
sat: Firefox ᱚᱲᱟᱜ

source: Firefox Home Page
sat: Firefox ᱚᱲᱟᱜ ᱥᱟᱦᱟᱴᱟ

source: Firefox is blocking parts of the page that may track your browsing.
sat: Firefox ᱥᱟᱦᱴᱟ ᱨᱮᱭᱟᱜ ᱚᱱᱟ ᱡᱟᱭᱜᱟ ᱠᱚ ᱟᱴᱠᱟᱣ ᱮᱫᱟ ᱚᱠᱟ ᱫᱚ ᱟᱢ ᱡᱟᱦᱟᱱᱟᱜ ᱯᱟᱱᱛᱮ ᱡᱷᱚᱜ ᱟᱢ ᱠᱚ ᱜᱷᱮᱨ ᱮᱥᱮᱫᱮᱫ ᱫᱟᱲᱮ ᱢᱮᱭᱟ ᱾

source: Firefox - Open Tabs
sat: Firefox - ᱴᱮᱵ ᱠᱚ ᱠᱷᱩᱞᱟᱹᱭ ᱢᱮ

source: Firefox - Quick Actions
sat: Firefox - ᱞᱚᱜᱚᱱ ᱛᱮᱭᱟ ᱠᱚᱢᱤ

source: Firefox - Recommended by Pocket
sat: Firefox - ᱯᱚᱠᱮᱴ ᱵᱟᱛᱟᱣ ᱠᱟᱫᱟᱭ

source: Firefox requires Face ID to access your saved logins.
sat: ᱟᱢᱟᱜ ᱥᱟᱺᱪᱟᱣ ᱠᱟᱱ ᱵᱚᱞᱚ ᱠᱚ ᱟᱫᱮᱨ ᱞᱟᱹᱜᱤᱫ Firefox ᱟᱢᱟᱜ ᱢᱚᱦᱲᱟ ID ᱫᱚᱨᱠᱟᱨ ᱾

source: Firefox Shortcuts
sat: Firefox ᱥᱚᱴᱠᱚᱴ

source: Firefox Sync
sat: Firefox ᱛᱷᱟᱨ ᱦᱚᱪᱚ

source: Firefox Sync has connected to %@
sat: Firefox ᱟᱛᱩᱨ ᱟᱬᱜᱚ %@ ᱥᱟᱞᱟᱜ ᱡᱩᱰᱟᱹᱣ ᱮᱱᱟᱭ

source: Firefox - Top Sites
sat: Firefox - ᱪᱮᱛᱟᱱ ᱨᱤᱱ ᱥᱟᱭᱤᱴ

source: Firefox won’t remember any of your history or cookies, but new bookmarks will be saved.
sat: Firefox ᱫᱚ ᱟᱢᱟᱜ ᱦᱤᱛᱟᱹᱞ ᱟᱨ ᱠᱩᱠᱤ ᱠᱚ ᱵᱟᱭ ᱩᱭᱦᱟᱹᱨ ᱟᱭ, ᱦᱮᱞᱮ ᱱᱟᱶᱟ ᱵᱩᱠᱢᱟᱨᱠ ᱫᱚ ᱥᱟᱸᱪᱟᱣ ᱜᱮᱭᱟ ᱾

source: Firefox would like to access your Photos
sat: Firefox ᱟᱢᱟᱠ ᱪᱤᱛᱚᱨ ᱠᱚ ᱟᱹᱛᱩᱨ ᱥᱟᱱᱟᱭ ᱤ ᱠᱟᱱᱟ

source: Folder
sat: ᱯᱚᱴᱚᱢ

source: Folder Name
sat: ᱯᱚᱴᱚᱢ ᱧᱩᱛᱩᱢ

source: For iOS 13 users, Firefox now automatically switches to a dark theme when your phone is set to Dark Mode. To change this behavior, go to Settings > Theme.
sat: iOS ᱑᱓ ᱵᱮᱵᱷᱟᱨᱤᱡᱟᱠ ᱞᱟᱹᱜᱤᱛ ᱠᱚ, Firefox ᱱᱤᱛ ᱫᱚ ᱟᱪᱛᱮ ᱦᱮᱸᱫᱮ ᱩᱭᱦᱚᱨ ᱛᱮ ᱵᱚᱫᱚᱞ ᱟᱭ ᱡᱚᱠᱷᱚᱱ ᱟᱢᱟᱠ ᱯᱷᱚᱱ ᱦᱮᱸᱫᱮ ᱚᱵᱚᱥᱛᱟ ᱨᱮ ᱥᱟᱡᱟ-ᱟ. ᱱᱚᱶᱟ ᱵᱮᱵᱷᱟᱨ ᱵᱚᱫᱚᱞ ᱞᱟᱹᱜᱤᱛ ᱛᱮ, ᱥᱟᱡᱟᱣ ᱠᱚ > ᱩᱭᱦᱚᱨ ᱛᱮ ᱪᱦᱟᱞᱟ ᱢᱮ.

source: Get your open tabs, bookmarks, and passwords from your other devices.
sat: ᱟᱢᱟᱜ ᱡᱷᱤᱡ ᱟᱠᱟᱱ ᱴᱮᱵ ᱠᱚ, ᱵᱩᱠᱢᱟᱨᱠ ᱠᱚ, ᱟᱨ ᱫᱟᱱᱟᱲ ᱥᱟᱵᱟᱫ ᱠᱚ ᱟᱢᱟᱜ ᱮᱴᱟᱠ ᱥᱟᱫᱷᱚᱱ ᱠᱷᱚᱱ ᱧᱟᱢ ᱢᱮ ᱾

source: Get your tabs, bookmarks, and passwords from your other devices.
sat: ᱟᱢᱟᱜ ᱴᱮᱵ ᱠᱚ, ᱵᱩᱠᱢᱟᱨᱠ ᱠᱚ, ᱟᱨ ᱫᱟᱱᱟᱲ ᱥᱟᱵᱟᱫ ᱠᱚ ᱟᱢᱟᱜ ᱮᱴᱟᱠ ᱥᱟᱫᱷᱚᱱ ᱠᱷᱚᱱ ᱧᱟᱢ ᱢᱮ᱾

source: Go
sat: ᱪᱟᱞᱟᱜ ᱢᱮ

source: Go to
sat: ᱨᱮ ᱪᱞᱟᱜ ᱢᱮ

source: Go to copied link
sat: ᱱᱚᱠᱚᱞ ᱟᱠᱟᱱ ᱞᱮᱸᱠ ᱛᱮ ᱪᱟᱞᱟᱜᱢᱮ

source: Go to copied link?
sat: ᱱᱚᱠᱚᱞ ᱞᱤᱸᱠ ᱨᱮ ᱪᱟᱞᱟᱜ ᱢᱮ?

source: Go to Copied Link
sat: ᱱᱚᱠᱚᱞ ᱟᱠᱟᱱ ᱞᱮᱸᱠ ᱛᱮ ᱪᱟᱞᱟᱜᱢᱮ

source: Great content from around the web.
sat: ᱚᱲᱤ ᱵᱷᱟᱞᱤ ᱵᱤᱥᱳᱭ ᱣᱮᱵ ᱫᱷᱟᱨᱮ ᱠᱷᱚᱱ ᱾

source: %@ has been successfully disconnected.
sat: %@ ᱨᱟᱥ ᱞᱮᱠᱟᱛᱮ ᱵᱟᱰ ᱡᱚᱲᱟᱣ ᱦᱩᱭᱮᱱᱟ᱾

source: Heads up!
sat: ᱵᱚᱦᱚ ᱪᱦᱚᱴ ᱥᱮ!

source: Hide
sat: ᱩᱠᱩᱭ ᱢᱮ

source: Homepage Settings
sat: ᱚᱲᱟᱜ ᱥᱟᱦᱴᱟ ᱥᱟᱡᱟᱣ ᱠᱚ

source: If a site doesn’t work as expected, tap the shield in the address bar and turn off Enhanced Tracking Protection for that page.
sat: ᱥᱟᱭᱤᱡ ᱡᱮᱞᱡᱠᱟ ᱞᱟᱸᱢᱤ ᱠᱟᱛᱷᱟ ᱵᱟᱭ ᱠᱟᱹᱢᱤ ᱞᱮᱫᱟᱭ, ᱡᱟᱹᱱᱠᱟᱨ ᱨᱮᱭᱟᱜ ᱥᱤᱞᱰ ᱨᱮ ᱴᱤᱯᱹᱟᱣ ᱢᱮ ᱟᱨ ᱥᱟᱠᱟᱢ ᱞᱟᱹᱜᱤᱫ ᱵᱟᱲᱦᱟᱣᱟᱠᱟᱱ ᱯᱟᱧᱡᱟ ᱫᱟᱱᱟᱲ ᱪᱤᱱᱦᱟᱹ ᱟᱰ ᱵᱚᱸᱫᱚᱭ ᱢᱮ ᱾

source: Immediately
sat: ᱞᱚᱜᱚᱱ ᱛᱮ

source: Incorrect passcode. Try again.
sat: ᱵᱷᱩᱞ ᱯᱟᱥᱠᱳᱰ ᱾ ᱫᱩᱦᱲᱟᱹ ᱪᱮᱥᱴᱟᱭ ᱢᱮ ᱾

source: Incorrect passcode. Try again (Attempts remaining: %d).
sat: ᱵᱷᱩᱞ ᱯᱟᱥᱠᱳᱰ ᱾ ᱫᱩᱦᱲᱟᱹ ᱪᱮᱥᱴᱟᱭ ᱢᱮ (ᱵᱤᱰᱟᱹᱣ ᱥᱟᱨᱮᱡᱺ %d)᱾

source: Increase text size
sat: ᱚᱱᱚᱞ ᱢᱟᱨᱟᱲᱛᱮᱛ ᱵᱚᱲᱛᱤ ᱢᱮ

source: It may be a misconfiguration or tampering by an attacker. Proceed if you accept the potential risk.
sat: ᱱᱚᱶᱟ ᱠᱟᱹᱢᱤ ᱫᱚ ᱟᱹᱲᱤᱰᱷᱟᱹᱲᱤ ᱞᱟᱹᱜᱤᱫ ᱟᱨ ᱵᱟᱝ ᱢᱩᱸᱦᱟᱹᱤᱡ ᱨᱮᱭᱟᱜ ᱠᱟᱹᱢᱤ ᱦᱩᱭ ᱠᱚᱜᱼᱟᱭ ᱾ ᱡᱚᱫᱤ ᱟᱢ ᱟᱢᱟᱜ ᱫᱟᱭᱛᱣᱚ ᱤᱫᱤ ᱥᱟᱱᱟᱢ ᱠᱷᱟᱱ ᱢᱟᱲᱟᱝ ᱥᱮᱱ ᱞᱟᱦᱟᱜ ᱢᱮ ᱾

source: just now
sat: ᱱᱤᱛᱚᱠ ᱜᱮ

source: Just to confirm, you wanted ‘Clear Private Tabs’?
sat: ᱟᱨ ᱢᱤᱫ ᱡᱮᱠᱷᱟ ᱵᱟᱲᱟᱭ ᱪᱷᱚ ᱞᱟᱹᱜᱤᱫ, ᱯᱨᱟᱭᱣᱮᱴ ᱴᱮᱵᱽ ᱠᱚ ᱢᱮᱴᱟᱣ ᱥᱟᱱᱟᱢ ᱠᱟᱱᱟ ᱥᱮ?

source: Just to confirm, you wanted ‘Go to Copied Link’?
sat: ᱟᱨ ᱢᱤᱫ ᱡᱮᱠᱷᱟ ᱵᱟᱲᱟᱭ ᱪᱷᱚ ᱞᱟᱹᱜᱤᱫ, ᱟᱢ ᱱᱚᱠᱚᱞ ᱠᱟᱱ ᱞᱤᱸᱠ ᱛᱮ ᱪᱟᱞᱟᱜ ᱥᱟᱱᱟᱢ ᱠᱟᱱᱟ ᱥᱮ?

source: Just to confirm, you wanted ‘New Private Search’?
sat: ᱟᱨ ᱢᱤᱫ ᱡᱮᱠᱷᱟ ᱵᱟᱲᱟᱭ ᱪᱷᱚ ᱞᱟᱹᱜᱤᱫ, ᱯᱨᱟᱭᱣᱮᱴ ᱥᱮᱸᱫᱽᱨᱟ ᱠᱚᱨᱟᱣ ᱥᱟᱱᱟᱢ ᱠᱟᱱᱟ ᱥᱮ?

source: Just to confirm, you wanted ‘New Search’?
sat: ᱟᱨ ᱢᱤᱫ ᱡᱮᱠᱷᱟ ᱵᱟᱲᱟᱭ ᱪᱷᱚ ᱞᱟᱹᱜᱤᱫ, ᱟᱢ ᱯᱟᱞᱮᱱ ᱱᱟᱶᱟ ᱥᱮᱸᱫᱽᱨᱟ ᱠᱚᱨᱟᱣ ᱥᱟᱱᱟᱢ ᱠᱟᱱᱟ ᱥᱮ?

source: Last month
sat: ᱛᱟᱭᱚᱢ ᱪᱟᱸᱫᱚ

source: Last synced: %@
sat: ᱢᱩᱪᱚᱛ ᱛᱷᱟᱨ ᱦᱚᱪᱚ: %@

source: Last week
sat: ᱛᱟᱭᱚᱢ ᱦᱟᱴ

source: Last Week
sat: ᱢᱟᱲᱟᱝ ᱦᱟᱴ

source: Learn How
sat: ᱪᱮᱫᱢᱮ ᱚᱠᱟᱞᱠᱟ

source: Learn More.
sat: ᱰᱷᱮᱨ ᱥᱮᱲᱟᱭ ᱢᱮ᱾

source: Learn more about how Tracking Protection blocks online trackers that collect your browsing data across multiple websites.
sat: ᱪᱮᱫ ᱢᱮ ᱚᱠᱟᱞᱠᱟ ᱛᱮ ᱯᱟᱧᱡᱟ ᱫᱟᱱᱟᱲ ᱟᱰ ᱟᱴᱠᱟᱣ ᱚᱱᱞᱟᱭᱤᱱ ᱜᱷᱮᱨ ᱮᱥᱮᱫ ᱠᱚ ᱟᱢᱜᱟ ᱧᱮᱞ ᱠᱩ ᱥᱟᱹᱠᱷᱤᱭᱟᱹᱛ ᱚᱞᱜᱟ ᱣᱮᱵᱥᱟᱭᱤᱴ ᱥᱟᱫᱷᱚᱱ ᱡᱚᱢᱟᱭᱮᱫ ᱟᱠᱚ ᱾

source: Licenses
sat: ᱞᱟᱤᱥᱮᱸᱥ ᱠᱚ

source: Load in Background
sat: ᱩᱯᱨᱩᱢ ᱨᱮ ᱞᱟᱫᱮ ᱢᱮ

source: Loading content…
sat: ᱵᱤᱥᱳᱭ ᱞᱟᱫᱮ ᱦᱩᱭᱩ ᱠᱟᱱᱟ...

source: Loading in Firefox
sat: Firefox ᱨᱮ ᱞᱟᱫᱮ ᱦᱩᱭᱩ ᱠᱟᱱᱟ

source: Load original page
sat: ᱢᱩᱞ ᱥᱟᱦᱟᱴᱟ ᱞᱟᱫᱮ

source: Login
sat: ᱵᱚᱞᱚ ᱢᱮ

source: Log in
sat: ᱵᱚᱞᱚ ᱢᱮ

source: Logins & Passwords
sat: ᱵᱚᱞᱚᱱ ᱠᱚ ᱟᱨ ᱫᱟᱱᱟᱲ ᱥᱟᱵᱟᱫ ᱠᱚ

source: Logins will be permanently removed.
sat: ᱵᱚᱞᱚ ᱠᱚ ᱜᱟᱹᱫᱤ ᱞᱮᱠᱷᱟᱛᱮ ᱚᱰᱚᱠᱚᱜᱼᱟ ᱾

source: Logins will be removed from all connected devices.
sat: ᱵᱚᱞᱚ ᱠᱚ ᱡᱷᱚᱛᱚ ᱡᱩᱰᱟᱹᱣ ᱥᱟᱫᱷᱚᱱ ᱠᱷᱚᱱ ᱚᱰᱚᱠᱚᱜᱼᱟ ᱾

source: Looks like Firefox crashed previously. Would you like to restore your tabs?
sat: ᱡᱟᱦᱟ ᱵᱩᱡᱷᱟᱣᱩᱜ ᱠᱟᱱᱟ Firefox ᱢᱟᱲᱟᱝ ᱨᱟᱹᱯᱩᱫ ᱞᱮᱱᱟ ᱾ ᱟᱢ ᱴᱮᱵᱥ ᱠᱚ ᱫᱩᱦᱲᱟᱹ ᱫᱚᱦᱚ ᱥᱟᱱᱟᱢ ᱠᱟᱱᱟ ᱥᱮ?

source: Mail App
sat: ᱢᱮᱞ ᱮᱯ

source: Manage Account & Devices
sat: ᱠᱷᱟᱛᱟ ᱟᱨ ᱥᱟᱫᱷᱚᱱ ᱠᱚ ᱵᱮᱵᱚᱥᱛᱟᱭ ᱢᱮ

source: Manual
sat: ᱛᱤ ᱛᱮᱭᱟᱠ

source: Mark as Read
sat: ᱯᱟᱲᱦᱟᱣ ᱞᱮᱠᱟ ᱪᱤᱸᱦᱟᱭ ᱢᱮ

source: Mark as Unread
sat: ᱵᱟᱲ ᱯᱟᱲᱦᱟᱣ ᱞᱮᱠᱟ ᱪᱤᱸᱦᱟᱭ ᱢᱮ

source: Maximum attempts reached. Please try again in an hour.
sat: ᱰᱷᱮᱨ ᱩᱛᱟᱹᱨ ᱵᱤᱰᱟᱹᱣ ᱥᱮᱴᱮᱨ᱾ ᱫᱚᱭᱟᱠᱟᱛᱮ ᱢᱤᱫ ᱴᱟᱲᱟᱝ ᱯᱚᱨᱮ ᱪᱮᱥᱴᱟᱭ ᱯᱮ᱾

source: Maximum attempts reached. Please try again later.
sat: ᱰᱷᱮᱨ ᱩᱛᱟᱹᱨ ᱵᱤᱰᱟᱹᱣ ᱥᱮᱴᱮᱨ᱾ ᱫᱚᱭᱟᱠᱟᱛᱮ ᱯᱚᱨᱮ ᱪᱮᱥᱴᱟᱭ ᱢᱮ᱾

source: Mobile Bookmarks
sat: ᱢᱚᱵᱟᱤᱞ ᱵᱩᱠᱢᱟᱨᱠ

source: mobile device
sat: ᱢᱚᱵᱟᱤᱞ ᱥᱟᱫᱷᱚᱱ

source: Modified
sat: ᱵᱚᱫᱚᱞᱟᱠ

source: Modified %@
sat: %@ ᱵᱚᱫᱚᱞᱮᱱᱟ

source: More
sat: ᱰᱷᱮᱨ

source: More Info…
sat: ᱵᱚᱲᱛᱤ ᱞᱚᱭ ᱥᱚᱫᱚᱨ...

source: more than a month ago
sat: ᱢᱤᱫ ᱪᱟᱸᱫᱚ ᱢᱟᱲᱟᱝ ᱠᱷᱚᱱ ᱡᱟᱹᱥᱛᱤ

source: more than a week ago
sat: ᱢᱤᱫ ᱦᱟᱴ ᱢᱟᱲᱟᱝ ᱠᱷᱚᱱ ᱡᱟᱹᱥᱛᱤ

source: Mozilla strives to only collect what we need to provide and improve Firefox for everyone.
sat: Mozilla ᱡᱟᱦᱟᱸ ᱩᱱ ᱡᱚᱠᱷᱟᱜ ᱡᱟᱣᱨᱟ ᱟᱭ ᱚᱠᱟ ᱡᱷᱚᱜ ᱫᱚᱨᱠᱟᱨᱚᱜᱼᱟ ᱚᱱᱟ ᱦᱚᱸ Firefox ᱟᱨ ᱡᱷᱚᱛᱚ ᱦᱚᱲ ᱠᱚ ᱞᱟᱹᱜᱤᱫ ᱵᱮᱥ ᱫᱚᱦᱚ ᱞᱟᱹᱜᱤᱫ ᱾

source: Navigation Toolbar
sat: ᱦᱚᱨ ᱯᱟᱱᱛᱮᱭᱟᱠ ᱴᱩᱞᱵᱟᱨ

source: New Bookmark
sat: ᱱᱟᱶᱟ ᱵᱩᱠᱢᱟᱨᱠ

source: New Folder
sat: ᱱᱟᱶᱟ ᱯᱚᱴᱚᱢ

source: New passcode must be different than existing code.
sat: ᱱᱟᱶᱟ ᱯᱟᱥᱠᱳᱰ ᱫᱚ ᱢᱟᱲᱟᱝ ᱠᱚᱰ ᱠᱷᱚᱱ ᱵᱷᱮᱜᱟᱨ ᱜᱮ ᱛᱟᱦᱮᱸᱱᱟ᱾

source: New Private Search
sat: ᱱᱟᱶᱟ ᱱᱤᱡᱮᱨᱟᱠ ᱥᱮᱸᱫᱽᱨᱟ

source: New Private Tab
sat: ᱱᱟᱶᱟ ᱱᱤᱡᱮᱨᱟᱠ ᱴᱮᱵ

source: New Private Tab opened
sat: ᱱᱟᱶᱟ ᱱᱤᱡᱮᱨᱟᱠ ᱴᱮᱵ ᱠᱷᱩᱞᱟᱹᱭᱱᱟ

source: New Search
sat: ᱱᱟᱶᱟ ᱥᱮᱸᱫᱽᱨᱟ

source: New Separator
sat: ᱱᱟᱶᱟ ᱵᱷᱮᱜᱟᱨᱟᱜ

source: New Tab
sat: ᱱᱟᱶᱟ ᱴᱮᱵ

source: New tab arrived from another device.
sat: ᱚᱞᱜᱟ ᱥᱟᱫᱷᱚᱱ ᱠᱷᱚᱱ ᱱᱟᱶᱟ ᱴᱮᱵ ᱦᱮᱡᱮᱱᱟ ᱾

source: New tab arrived in %@
sat: %@ ᱨᱮ ᱱᱟᱶᱟ ᱴᱮᱵ ᱡᱮᱡᱮᱱᱟ

source: New Tab opened
sat: ᱱᱟᱶᱟ ᱴᱮᱵ ᱠᱷᱩᱞᱟᱹᱭᱱᱟ

source: Next
sat: ᱤᱱᱟᱹ ᱛᱟᱭᱚᱢ

source: Next in-page result
sat: ᱤᱱᱟᱹ ᱛᱟᱭᱚᱢ ᱚᱱᱟᱼᱥᱟᱠᱟᱢ ᱠᱩᱲᱟᱹᱭ

source: No Internet Connection
sat: ᱤᱱᱴᱟᱹᱨᱱᱮᱴ ᱡᱚᱱᱚᱲᱟᱣ ᱵᱟᱹᱱᱩᱠ-ᱟ

source: No logins found
sat: ᱵᱚᱞᱚ ᱠᱚ ᱵᱟᱭ ᱧᱟᱢ ᱞᱮᱱᱟ

source: No open tabs.
sat: ᱴᱮᱵ ᱠᱚ ᱡᱷᱤ ᱵᱚᱱᱩ-ᱟ.

source: No Open Tabs
sat: ᱴᱮᱵ ᱠᱚ ᱡᱷᱤ ᱵᱚᱱᱩ-ᱟ.

source: Normal Browsing Mode
sat: ᱥᱟᱫᱷᱟᱨᱚᱱ ᱯᱟᱱᱛᱮᱭᱟᱠ ᱚᱵᱚᱥᱛᱟ

source: No tabs
sat: ᱴᱮᱵ ᱠᱚ ᱵᱚᱱᱩ-ᱟ

source: Not Now
sat: ᱱᱤᱛᱚᱜ ᱫᱚ ᱵᱟᱸ

source: No trackers known to Firefox were detected on this page.
sat: ᱱᱚᱶᱟ ᱥᱟᱠᱟᱢ ᱨᱮ Firefox ᱥᱟᱞᱟᱜ ᱚᱠᱚᱭ ᱦᱚᱸ ᱯᱟᱧᱡᱟ ᱫᱟᱱᱟᱲ ᱠᱚ ᱵᱟᱠᱚ ᱵᱟᱰᱟᱭ ᱞᱮᱱᱟ ᱾

source: No tracking elements detected on this page.
sat: ᱱᱚᱶᱟ ᱥᱟᱦᱴᱟ ᱨᱮ ᱯᱟᱸᱡᱟ ᱡᱤᱱᱤᱥ ᱵᱟᱝ ᱧᱟᱢ ᱞᱮᱱᱟ᱾

source: Offers stronger protection, but may cause some sites to break.
sat: ᱡᱟᱹᱥᱛᱤ ᱥᱩᱨᱟᱹᱠᱷᱤᱭᱟᱹ ᱮᱢᱚᱜᱼᱟᱭ, ᱦᱮᱞᱮ ᱠᱤᱪᱷᱤ ᱥᱟᱭᱤᱴ ᱨᱟᱹᱯᱩᱫ ᱫᱟᱲᱮᱟᱜᱼᱟ ᱠᱚ ᱾

source: Offer to Open Copied Links
sat: ᱱᱚᱠᱚᱞ ᱟᱠᱟᱱ ᱥᱟᱭᱤᱴ ᱠᱷᱩᱞᱟᱹ ᱯᱨᱚᱥᱛᱟᱣ

source: Offer to translate any site written in a language that is different from your default language.
sat: ᱦᱩᱲᱟᱜ ᱨᱮ ᱚᱠᱟ ᱟᱲᱟᱝ ᱢᱮᱱᱟᱜᱼᱟ ᱚᱱᱟ ᱠᱷᱚᱱ ᱵᱷᱮᱜᱟᱨ ᱟᱲᱟᱝ ᱛᱟᱦᱮᱱ ᱠᱷᱟᱱ ᱛᱚᱨᱡᱚᱢᱟ ᱞᱟᱹᱜᱤᱫ ᱯᱨᱚᱥᱛᱟᱵ ᱟᱹᱜᱩᱭ ᱢᱮ ᱾

source: Offer Translation
sat: ᱛᱚᱨᱡᱚᱢᱟ ᱮᱢᱚᱜ ᱢᱮ

source: Offline Website Data
sat: ᱟᱺᱯᱷᱞᱟᱤᱱ ᱣᱮᱵ ᱥᱟᱭᱤᱴ ᱥᱟᱹᱠᱷᱤᱭᱟᱹᱛ

source: Okay
sat: ᱴᱷᱤᱠ ᱜᱮ

source: Only HTTP and HTTPS links can be shared.
sat: ᱮᱠᱷᱮᱱ HTTP ᱟᱨ HTTPS ᱞᱤᱸᱠ ᱠᱚ ᱜᱤ ᱦᱟᱹᱴᱤᱧᱟᱜ ᱫᱚᱲᱤ ᱟᱢ᱾

source: Only when using Tracking Protection
sat: ᱡᱚᱠᱷᱚᱱ ᱯᱟᱸᱡᱟ ᱨᱚᱯᱷᱟ ᱵᱮᱵᱷᱟᱨ ᱦᱩᱭᱩ ᱠᱟᱱᱟ

source: On your computer open Firefox and go to firefox.com/pair
sat: ᱟᱢᱟᱜ ᱠᱚᱢᱯᱤᱭᱩᱴᱚᱨ ᱨᱮ Firefox ᱡᱷᱤᱜ ᱢᱮ ᱟᱨ firefox.com/pair ᱨᱮ ᱪᱟᱞᱟ ᱢᱮ

source: Oops! Firefox crashed
sat: ᱚᱦᱟᱭ! Firefox ᱨᱚᱯᱩᱫᱮᱱᱟ

source: Open App Store
sat: ᱮᱯ ᱜᱚᱫᱟᱢ ᱠᱷᱩᱞᱟᱹᱭ ᱢᱮ

source: Open articles in Reader View by tapping the book icon when it appears in the title bar.
sat: ᱴᱚᱭᱴᱚᱞ ᱵᱟᱨ ᱨᱮᱭᱟᱜ ᱯᱚᱛᱚᱵ ᱟᱭᱠᱚᱱ ᱨᱮ ᱞᱤᱱ ᱠᱟᱛᱮ ᱯᱟᱲᱦᱟᱣ ᱧᱮᱞ ᱨᱮ ᱚᱱᱚᱞ ᱠᱷᱩᱞᱟᱹᱢᱮ ᱾

source: Open & Fill
sat: ᱡᱷᱤᱜ ᱢᱮ ᱟᱨ ᱯᱮᱨᱮᱡ ᱢᱮ

source: Open Firefox
sat: Firefox ᱡᱷᱤᱜ ᱢᱮ

source: Open in Firefox
sat: Firefox ᱨᱮ ᱡᱷᱤᱜ ᱢᱮ

source: Open in New Private Tab
sat: ᱱᱟᱶᱟ ᱱᱤᱡᱮᱨᱟᱠ ᱴᱮᱵ ᱨᱮ ᱡᱷᱤᱜ ᱢᱮ

source: Open in New Tab
sat: ᱱᱟᱶᱟ ᱴᱮᱵ ᱨᱮ ᱡᱷᱤᱜ ᱢᱮ

source: Open in Private Mode
sat: ᱱᱤᱡᱮᱨᱟᱠ ᱚᱵᱥᱛᱟ ᱨᱮ ᱡᱷᱤᱜ ᱢᱮ

source: Open in Safari
sat: Safari ᱨᱮ ᱠᱷᱩᱞᱟᱹᱭ ᱢᱮ

source: Open Last Bookmark
sat: ᱢᱩᱪᱟᱹᱫ ᱵᱩᱠᱢᱟᱨᱠ ᱠᱷᱩᱞᱟᱹᱭ ᱢᱮ

source: Open Last Tab
sat: ᱢᱩᱪᱟᱹᱫ ᱴᱮᱵ ᱠᱷᱩᱞᱟᱹᱭ ᱢᱮ

source: Open mail links with
sat: ᱢᱮᱞ ᱞᱤᱸᱠ ᱱᱚᱶᱟ ᱛᱮ ᱡᱷᱤᱜ ᱢᱮ

source: Open New Private Tab
sat: ᱱᱟᱶᱟ ᱱᱤᱡᱮᱨᱟᱠ ᱴᱮᱵ ᱡᱷᱤᱜ ᱢᱮ

source: Open New Tab
sat: ᱱᱟᱶᱟ ᱴᱮᱵ ᱠᱷᱩᱞᱟᱹᱭ ᱢᱮ

source: Open Selected Tab
sat: ᱵᱟᱪᱷᱟᱣᱟᱠ ᱴᱮᱵ ᱠᱷᱩᱞᱟᱹᱭ ᱢᱮ

source: Open Settings
sat: ᱥᱟᱡᱟᱣ ᱠᱚ ᱡᱷᱤᱜ ᱢᱮ

source: Open Sync Preferences
sat: ᱟᱹᱭᱩᱨ ᱢᱤᱫ ᱠᱩᱥᱤᱠᱚ ᱠᱷᱩᱞᱟᱹᱭ ᱢᱮ

source: Open this link in external app?
sat: ᱱᱚᱶᱟ ᱞᱤᱸᱠ ᱵᱟᱦᱨᱮ ᱮᱯᱯ ᱨᱮ ᱠᱷᱩᱞᱟᱹᱭ ᱢᱮ?

source: Open this link in the App Store?
sat: ᱱᱚᱶᱟ ᱞᱤᱸᱠ App ᱜᱚᱫᱟᱢ ᱨᱮ ᱠᱷᱩᱞᱟᱹᱭ ᱢᱮ?

source: Page Actions
sat: ᱥᱟᱦᱟᱴᱟ ᱠᱚᱢᱤ ᱠᱚ
